<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"><head>
<meta http-equiv="content-type" content="text/html; charset=ISO-8859-1" /><title>WorkSpaceManager</title></head>
<body><small><small>Copyright (c) Prolog Developemnt Center SPb</small></small>
<h2 style="font-family: Arial;">PdcVipSolutions<br /></h2>
Version 2.0<br /><br />PdcVipSolutions
v.2.0 - &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072;&#1073;&#1086;&#1088;&#1086;&#1084; &#1087;&#1072;&#1082;&#1077;&#1090;&#1086;&#1074;, &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1086;&#1074; &#1080; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1074;, &#1103;&#1074;&#1083;&#1102;&#1103;&#1097;&#1080;&#1093;&#1089;&#1103;
&#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077;&#1084; &#1086;&#1092;&#1080;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1076;&#1091;&#1082;&#1090;&#1072; &#1092;&#1080;&#1088;&#1084;&#1099; PDC Visual Prolog.<br />&#1042;&#1077;&#1088;&#1089;&#1080;&#1103; 2.0 &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&nbsp; Vip version 9001.<br /><br />&#1042;&#1089;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1072;&#1088;&#1080;&#1103; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1073;&#1099;&#1090;&#1100; &#1087;&#1086;&#1084;&#1077;&#1097;&#1077;&#1085;&#1086; &#1074; &#1086;&#1076;&#1085;&#1091; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1102; &#1089; &#1080;&#1084;&#1077;&#1085;&#1072;&#1084;&#1080; &#1087;&#1086;&#1076;&#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1081; &#1082;&#1072;&#1082; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1085;&#1080;&#1078;&#1077;<br /><span style="font-weight: bold;">SpbRSolutions</span> (&#1082;&#1086;&#1088;&#1085;&#1077;&#1074;&#1072;&#1103; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1103; &#1084;&#1086;&#1078;&#1077;&#1090; &#1080;&#1084;&#1077;&#1090;&#1100; &#1083;&#1102;&#1073;&#1086;&#1077; &#1080;&#1084;&#1103;)<br />&nbsp;&nbsp;&nbsp; <span style="font-weight: bold;">SpbExamples</span> (&#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; SpbExamples &#1074; GitHub)<br />&nbsp;&nbsp;&nbsp; <span style="font-weight: bold;">SpbProjects</span> (&#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1073;&#1099;&#1090;&#1100; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1072;)<span style="font-weight: bold;"><br />&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp; DelFiles&nbsp;</span>(&#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; DelFiles &#1074; GitHub)<span style="font-weight: bold;"><br />&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp; WS_Manager &nbsp;</span>(&#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; WS_Manager &#1074; GitHub)<br />&nbsp;&nbsp;&nbsp; <span style="font-weight: bold;">SpbVipTools </span>(&#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; SpbVipTools &#1074; GitHub)<br /><br />&#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1094;&#1077;&#1083;&#1100;&#1102; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080;&nbsp; 2.0 &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1076;&#1077;&#1084;&#1086;&#1085;&#1089;&#1090;&#1088;&#1072;&#1094;&#1080;&#1103; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; <span style="font-weight: bold;">WorkSpace Manager</span>.<br />&#1057;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;,&nbsp;SpbVipTools
&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072;&#1073;&#1086;&#1088;&#1086;&#1084; &#1087;&#1072;&#1082;&#1077;&#1090;&#1086;&#1074;, &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1102;&#1097;&#1080;&#1093; &#1101;&#1090;&#1086;&#1090; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1072; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099; &#1089;&#1083;&#1091;&#1078;&#1072;&#1090;
&#1076;&#1083;&#1103; &#1076;&#1077;&#1084;&#1086;&#1085;&#1089;&#1090;&#1088;&#1072;&#1094;&#1080;&#1080; &#1077;&#1075;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;.<br /><br />&#1042;&#1077;&#1088;&#1089;&#1080;&#1103; 2.0 &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1099;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1080; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1077; &#1082;&#1086;&#1076;&#1099; &#1074;&#1089;&#1077;&#1093; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081; &#1080; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1086;&#1074;.<br /><br />&#1048;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1099;&#1077; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086;&#1084;&#1077;&#1097;&#1077;&#1085;&#1099; &#1074; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1102; <span style="font-weight: bold;">SpbRSolutions/SpbVipTools/Bin</span>.<br />&#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; WorksSpace Manager &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1085;&#1072;&#1081;&#1076;&#1077;&#1085;&#1072; &#1074; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1080;<span style="font-weight: bold;"> SpbRSolutions/Bin/wsmAppData</span>, &#1075;&#1076;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1085;&#1072;&#1081;&#1090;&#1080;<br />&nbsp;&nbsp;&nbsp; <span style="font-weight: bold;">ReadMe(En/Ru).pdf</span> - &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1102; &#1087;&#1086; &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1080;&#1102; &#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1091; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081;<br />&nbsp;&nbsp;&nbsp; <span style="font-weight: bold;">WorkSpaceManager(En/Ru).pdf</span> - &#1086;&#1073;&#1097;&#1072;&#1103; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103; &#1086; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1080;<br />&nbsp; &nbsp; <span style="font-weight: bold;">wsm_help(En/Ru).chm</span>&nbsp;&nbsp;&nbsp; - &nbsp;&#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1081;&nbsp; MS Help, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1074;&#1099;&#1079;&#1074;&#1072;&#1085; &#1080;&#1079; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; <span style="font-weight: bold;">WorkSpaceManager.exe</span>.<br /><br />&#1055;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; <span style="font-weight: bold;">WorkSpaceManager</span>
, &#1082;&#1088;&#1086;&#1084;&#1077; &#1090;&#1086;&#1075;&#1086; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1086; &#1082;&#1072;&#1082; &#1080;&#1085;&#1090;&#1077;&#1075;&#1088;&#1072;&#1094;&#1080;&#1103; &#1095;&#1072;&#1089;&#1090;&#1080; http-backend &#1080;
http-frontend. &#1069;&#1090;&#1086; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1086;&#1073;&#1086;&#1081; &#1087;&#1077;&#1088;&#1074;&#1099;&#1081; &#1096;&#1072;&#1075; &#1085;&#1072; &#1087;&#1091;&#1090;&#1080; &#1082; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;&#1084;,
&#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1084; &#1085;&#1072; &#1080;&#1076;&#1077;&#1103;&#1093; &#1084;&#1080;&#1082;&#1088;&#1086;&#1089;&#1077;&#1088;&#1074;&#1080;&#1089;&#1086;&#1074;. &#1042; &#1101;&#1090;&#1086;&#1084; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;&#1077;:<br />&nbsp;&nbsp; &nbsp;&#1084;&#1085;&#1086;&#1075;&#1086;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1086;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1085;&#1077; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;.<br />&nbsp; &nbsp; &#1085;&#1077;&#1090; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1081; &#1088;&#1077;&#1072;&#1082;&#1094;&#1080;&#1080; &#1085;&#1072; &#1090;&#1086;&#1090; &#1089;&#1083;&#1091;&#1095;&#1072;&#1081; &#1077;&#1089;&#1083;&#1080; &nbsp;http-backend &#1085;&#1077; &#1079;&#1072;&#1087;&#1091;&#1097;&#1077;&#1085;.<br />&#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1094;&#1077;&#1083;&#1100; &#1079;&#1076;&#1077;&#1089;&#1100; &#1073;&#1099;&#1083;&#1072; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1079;&#1072;&#1076;&#1072;&#1095;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1099;&#1077; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1088;&#1077;&#1096;&#1080;&#1090;&#1100; &#1074; &#1073;&#1091;&#1076;&#1091;&#1097;&#1077;&#1084;.<br /><br />&#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099;,
&#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1085;&#1099;&#1077; &#1074;&nbsp; version 2.0, &#1073;&#1099;&#1083;&#1080; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1085;&#1099; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1083;&#1077;&#1090; &#1085;&#1072;&#1079;&#1072;&#1076; &#1080;
&#1073;&#1077;&#1079; &#1086;&#1089;&#1086;&#1073;&#1086;&#1081; &#1082;&#1086;&#1088;&#1088;&#1077;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1082;&#1080; &#1086;&#1090;&#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1099; &#1074;&#1077;&#1088;&#1089;&#1080;&#1077;&#1081; Vip9.</body></html>