<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"><head>
<meta http-equiv="content-type" content="text/html; charset=ISO-8859-1" /><title>PdcVipSolutions</title></head>
<body>
<span style="font-family: Arial;"><span style="color: rgb(204, 0, 0);"></span></span><small style="font-family: Arial;"><small style="font-weight: bold;">Copyright (c) Prolog Development
Center SPb</small></small><br style="font-family: Arial;" />
<span style="font-family: Arial; font-weight: bold;">OpenSource
(MIT License)</span><br style="font-family: Arial;" />
<br />&#1053;&#1077; &#1089;&#1090;&#1077;&#1089;&#1085;&#1103;&#1081;&#1090;&#1077;&#1089;&#1100; &#1079;&#1072;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1099; &#1087;&#1086; &#1072;&#1076;&#1088;&#1077;&#1089;&#1091;&nbsp; <span style="font-weight: bold;">VictorYukhtenko@pdc.spb.su</span> &#1080;&#1083;&#1080; <span style="font-weight: bold;">victor.a.yukhtenko@gmail.com</span>.<br /><h3>SpbVipSolutions &#1074;&#1077;&#1088;&#1089;&#1080;&#1103; 3.0 (&#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1086; VipCe v.9002)</h3>&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090;:<br /><span style="color: rgb(204, 0, 0);">&#1053;&#1086;&#1074;&#1086;&#1077;</span>: Applicaiton Frame - &#1096;&#1072;&#1073;&#1083;&#1086;&#1085; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1085;&#1072;&#1073;&#1086;&#1088;&#1072; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1086;&#1074; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080; &#1090;&#1086;&#1075;&#1086; &#1078;&#1077; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1085;&#1072; &#1086;&#1089;&#1085;&#1086;&#1074;&#1077; &#1082;&#1086;&#1085;&#1094;&#1077;&#1087;&#1094;&#1080;&#1080; <span style="font-weight: bold;">BackEnd-FrontEnd</span>.<br /><span style="font-weight: bold;">WorkSpace Manager</span> (&#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1080; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;). &#1060;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1085;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1083;&#1072;&#1089;&#1100; &#1087;&#1086; &#1089;&#1088;&#1072;&#1074;&#1085;&#1077;&#1085;&#1080;&#1102; &#1089; &#1074;&#1077;&#1088;&#1089;&#1080;&#1077;&#1081; 2.0<br /><br /><span style="color: rgb(204, 0, 0);">&#1045;&#1089;&#1083;&#1080; &#1091; &#1074;&#1072;&#1089;&nbsp;&#1085;&#1077;&#1082;&#1086;&#1084;&#1084;&#1077;&#1088;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103; Vip, &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; &#1075;&#1086;&#1090;&#1086;&#1074;&#1099;&#1077; &#1082; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1102; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; (&#1074; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090;&#1077;).</span><br style="font-family: Arial;" />
<span style="font-family: Arial;"><br /></span><h2><span style="font-family: Arial;"><span style="font-weight: bold;">PdcVipSolutions</span></span></h2>
<span style="font-family: Arial; font-weight: bold;">Version
3.0</span><br style="font-family: Arial;" />
<span style="font-family: Arial;">&nbsp; &nbsp; <br />PdcVipSolutions - &#1101;&#1090;&#1086; &#1085;&#1072;&#1073;&#1086;&#1088; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;, &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1086;&#1074; &#1080; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1074; &#1082;&#1072;&#1082; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; &#1082; &#1086;&#1092;&#1080;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084;&#1091; &#1087;&#1088;&#1086;&#1076;&#1091;&#1082;&#1090;&#1091; &#1092;&#1080;&#1088;&#1084;&#1099; PDC Visual Prolog.<br /><br />&#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1084; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;&#1084; <span style="font-weight: bold;">PdcVipSolutions</span> &#1085;&#1072; &#1089;&#1077;&#1075;&#1086;&#1076;&#1085;&#1103;&#1096;&#1085;&#1080;&#1081; &#1076;&#1077;&#1085;&#1100; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103;<br />&nbsp;&nbsp;&nbsp;&nbsp; SpbProjects (<span style="font-weight: bold;">&#1082;&#1083;&#1102;&#1095;&#1077;&#1074;&#1099;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099;</span>)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <span style="font-weight: bold;">WorkSpace Manager</span> - <a href="WorkSpaceManager/HelpRu.html">&#1089;&#1084;. &#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;</a></span><span style="font-family: Arial;"><span style="color: red;"></span></span><span style="font-family: Arial;"><br />&nbsp;&nbsp;&nbsp;&nbsp; SpbSolutions (<span style="font-weight: bold;">&#1082;&#1083;&#1102;&#1095;&#1077;&#1074;&#1099;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099;</span>)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#1064;&#1072;&#1073;&#1083;&#1086;&#1085; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; <span style="font-weight: bold;">FeBe</span> (&#1082;&#1083;&#1080;&#1077;&#1085;&#1090;-&#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1085;&#1086;&#1077; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;) - <a href="AppFrameCookBook/CookBook/CookBookIndexRu.html">&#1089;&#1084;. &#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;</a></span><span style="font-family: Arial;"><span style="color: red;"></span></span><span style="font-family: Arial;"><br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#1055;&#1072;&#1082;&#1077;&#1090;&#1099; - &#1055;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1072; &#1091;&#1087;&#1086;&#1084;&#1103;&#1085;&#1091;&#1090;&#1099;&#1093; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1074;, &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1086;&#1074; &#1080; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1086;&#1074;<br />&nbsp;&nbsp;&nbsp;&nbsp; SpbExamples (<span style="font-weight: bold;">&#1082;&#1083;&#1102;&#1095;&#1077;&#1074;&#1099;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099;</span>), &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083;<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <span style="font-weight: bold;">FeBe</span> - &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1072; Applicaion Frame<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <span style="font-weight: bold;">Polyline</span> - 14 &#1096;&#1072;&#1075;&#1086;&#1074; &#1086;&#1090; &#1087;&#1088;&#1080;&#1084;&#1080;&#1090;&#1080;&#1074;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1085;&#1089;&#1086;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1082; &#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1084;&#1091; &#1085;&#1072; <a href="AppFrameCookBook/CookBook/VpPuzzle/VpPuZzle%20Introduction.htm">PzlSystem</a> &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1102; WinGui<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <span style="font-weight: bold;">vpPuzzle</span> - &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1099;&#1093; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1086;&#1074; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; pzlSystem<br /></span><br style="font-family: Arial;" />
<span style="font-family: Arial;">&#1042;&#1077;&#1089;&#1100; &#1082;&#1086;&#1085;&#1090;&#1077;&#1085;&#1090; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1090;&#1100; &#1087;&#1086;&#1084;&#1077;&#1097;&#1077;&#1085; &#1074; &#1086;&#1076;&#1080;&#1085; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075; &#1089;&#1086; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1086;&#1081; &#1080; &#1080;&#1084;&#1077;&#1085;&#1072;&#1084;&#1080;, &#1082;&#1072;&#1082; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1085;&#1080;&#1078;&#1077;<br /><span style="font-weight: bold;">SpbRSolutions</span> (&#1082;&#1086;&#1088;&#1085;&#1077;&#1074;&#1086;&#1081; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075; &#1084;&#1086;&#1078;&#1077;&#1090; &#1080;&#1084;&#1077;&#1090;&#1100; &#1083;&#1102;&#1073;&#1086;&#1077; &#1076;&#1088;&#1091;&#1075;&#1086;&#1077; &#1080;&#1084;&#1103;)<br />&nbsp;&nbsp;&nbsp;&nbsp; <span style="font-weight: bold;">SpbExamples</span> (&#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; SpbExamples &#1074; GitHub)<br />&nbsp;&nbsp;&nbsp;&nbsp; <span style="font-weight: bold;">SpbProjects</span> (&#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1090;&#1100; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <span style="font-weight: bold;">DelFiles</span> (&#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; DelFiles &#1074; GitHub)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <span style="font-weight: bold;">WS_Manager</span> (&#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; WS_Manager &#1074; GitHub)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <span style="font-weight: bold;">SetSpbToolsToVip</span> (&#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; SetSpbToolsToVip &#1074; GitHub)<br />&nbsp;&nbsp;&nbsp;&nbsp; <span style="font-weight: bold;">SpbVipTools</span> (&#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; SpbVipTools &#1074; GitHub)<br />&nbsp;&nbsp;&nbsp;&nbsp; SpbVipTools - &#1101;&#1090;&#1086; &#1085;&#1072;&#1073;&#1086;&#1088; &#1087;&#1072;&#1082;&#1077;&#1090;&#1086;&#1074; &#1076;&#1083;&#1103; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1080; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1074;.<br /><br /></span><span style="font-family: Arial;">&#1051;&#1091;&#1095;&#1096;&#1080;&#1081; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1080;&#1103; &#1074;&#1089;&#1077;&#1093; &#1074;&#1089;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1074; - &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; <span style="font-weight: bold;">SpbVipTools\Bin\WorkSpaceManager.exe</span> &#1089;&nbsp; &#1076;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080;&nbsp; <span style="font-weight: bold;">SpbVipTools\UserWS\DemoWorspace.wsm</span><br /><br />&#1056;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1091;&#1077;&#1090;&#1089;&#1103; &#1089;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; <span style="font-weight: bold;">SpbVipTools\Bin\SetSpbToolsToVip.exe</span>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1087;&#1086;&#1076;&#1075;&#1086;&#1090;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1077; &#1080; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1099; IDE.<br /></span><span style="font-family: Arial;">&#1048;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1099;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074; <span style="font-weight: bold;">SpbRSolutions/SpbVipTools/Bin</span>.</span><br /><span style="font-family: Arial;"></span><h3><span style="font-family: Arial;"><span style="font-weight: bold;">WorkSpace Manager</span></span></h3>
<span style="font-family: Arial;">&#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103; &#1076;&#1083;&#1103; WorksSpace Manager &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085;&#1072; &#1074; <span style="font-weight: bold;">SpbRSolutions/Bin/wsmAppData</span>, &#1075;&#1076;&#1077; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1085;&#1072;&#1081;&#1090;&#1080;<br />&nbsp;&nbsp;&nbsp;&nbsp; <span style="font-weight: bold;">ReadMe (En / Ru) .pdf</span> - &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1103; &#1087;&#1086; &#1089;&#1073;&#1086;&#1088;&#1082;&#1077; &#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1091; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081;<br />&nbsp;&nbsp;&nbsp;&nbsp; <span style="font-weight: bold;">WorkSpaceManager (En / Ru) .pdf</span> - &#1086;&#1073;&#1097;&#1072;&#1103; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103; &#1086;&#1073; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1077;<br />&nbsp;&nbsp;&nbsp;&nbsp; <span style="font-weight: bold;">wsm_help (En / Ru) .chm</span> - &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1072;&#1103; &#1089;&#1087;&#1088;&#1072;&#1074;&#1082;&#1072; MS, &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1090;&#1072;&#1082;&#1078;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1099;&#1079;&#1074;&#1072;&#1090;&#1100; &#1080;&#1079; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; <span style="font-weight: bold;">WorkSpaceManager.exe</span>.<br /><br />WorkSpaceManager &#1090;&#1072;&#1082;&#1078;&#1077; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085; &#1082;&#1072;&#1082; &#1089;&#1074;&#1103;&#1079;&#1082;&#1072; Backend-Frontend &#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1086;&#1084; http.<br />&#1054;&#1076;&#1085;&#1072;&#1082;&#1086;<br /></span><ul><li><span style="font-family: Arial;">&#1084;&#1085;&#1086;&#1075;&#1086;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1081; </span><span style="font-family: Arial;">&#1088;&#1077;&#1078;&#1080;&#1084; &#1085;&#1077; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;</span><span style="font-family: Arial;">.</span></li><li><span style="font-family: Arial;">&#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1089;&#1090;&#1080; BackEnd &#1085;&#1077; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1103;&#1077;&#1090;&#1089;&#1103;.</span></li></ul><span style="font-family: Arial;">&#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1094;&#1077;&#1083;&#1100;&#1102; &#1073;&#1099;&#1083;&#1086; &#1085;&#1072;&#1084;&#1077;&#1090;&#1080;&#1090;&#1100; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1079;&#1072;&#1076;&#1072;&#1095;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1086;&#1080;&#1090; &#1088;&#1077;&#1096;&#1080;&#1090;&#1100; &#1074; &#1073;&#1091;&#1076;&#1091;&#1097;&#1077;&#1084;.<br />&#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103;, &#1073;&#1099;&#1083;&#1080; &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1099; &#1084;&#1085;&#1086;&#1075;&#1086; &#1083;&#1077;&#1090; &#1085;&#1072;&#1079;&#1072;&#1076;. &#1054;&#1085;&#1080; &#1073;&#1099;&#1083;&#1080; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1099; &#1076;&#1083;&#1103;&nbsp; VIP9x.<br /></span><h3><span style="font-family: Arial; font-weight: bold;">Application
Frame</span></h3>
<span style="font-family: Arial;"><span style="font-weight: bold;">Application Frame</span>, &#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1085; &#1085;&#1072; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;&#1077;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1086;&#1084; &#1074; <span style="font-weight: bold;">WorkSpaceManager</span>, &#1085;&#1086; &#1074;&#1089;&#1077; &#1084;&#1077;&#1093;&#1072;&#1085;&#1080;&#1079;&#1084;&#1099; &#1073;&#1099;&#1083;&#1080; &#1082;&#1072;&#1088;&#1076;&#1080;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1099;.<br /></span><span style="font-family: Arial; font-weight: bold;">Application Frame</span><span style="font-family: Arial;">&nbsp;&#1084;&#1086;&#1078;&#1077;&#1090; &#1089;&#1083;&#1091;&#1078;&#1080;&#1090;&#1100; &#1086;&#1089;&#1085;&#1086;&#1074;&#1086;&#1081; &#1076;&#1083;&#1103; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077;:<br /></span><ul><li><span style="font-family: Arial;">&#1080;&#1084;&#1102;&#1090; &#1082;&#1083;&#1080;&#1077;&#1085;&#1090;-&#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1085;&#1091;&#1102; &#1072;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1091; &#1074; &#1092;&#1086;&#1088;&#1084;&#1077; <span style="font-weight: bold;">FrontEnd</span> &#1080; <span style="font-weight: bold;">BackEnd</span>, &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1091;&#1103; &#1083;&#1080;&#1073;&#1086; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1084;&#1086;&#1085;&#1086;-&#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;, &#1083;&#1080;&#1073;&#1086; &#1095;&#1077;&#1088;&#1077;&#1079; <span style="font-weight: bold;">HTTP</span></span></li><li><span style="font-family: Arial;">&#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1085;&#1099; &#1085;&#1072; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; (&#1083;&#1077;&#1085;&#1090;&#1072;)&nbsp;&#1080; &#1080;&#1084;&#1077;&#1102;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1086;&#1090;&#1083;&#1080;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1080;:</span></li><ul><li><span style="font-family: Arial;">&#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; (&#1083;&#1077;&#1085;&#1090;&#1072;) &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1072;, &#1074; &#1090;&#1086;&#1084; &#1095;&#1080;&#1089;&#1083;&#1077; &#1082;&#1072;&#1082; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072; XML</span></li><li><span style="font-family: Arial;">&#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; (&#1083;&#1077;&#1085;&#1090;&#1072;) &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1083;&#1077;&#1075;&#1082;&#1086; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1072; &#1080; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1072;</span></li></ul><li><span style="font-family: Arial;">&#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1090;
&#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1103;&#1090;&#1100; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1087;&#1091;&#1090;&#1077;&#1084; &#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1103; &#1087;&#1083;&#1072;&#1075;&#1080;&#1085;&#1086;&#1074;, &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1085;&#1099;&#1093; &#1089;
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1090;&#1077;&#1093;&#1085;&#1086;&#1083;&#1086;&#1075;&#1080;&#1080; PZL (<a href="AppFrameCookBook/CookBook/VpPuzzle/VpPuZzle%20Introduction.htm">&#1089;&#1084;. VipPzlSystem</a>)</span></li><li><span style="font-family: Arial;">&#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1080; &#1076;&#1083;&#1103; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1086;&#1075;&#1086; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1072;, &#1074; &#1090;&#1086;&#1084; &#1095;&#1080;&#1089;&#1083;&#1077; &#1076;&#1083;&#1103; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1084;&#1085;&#1086;&#1075;&#1086;&#1103;&#1079;&#1099;&#1095;&#1085;&#1099;&#1093; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081;</span></li><li><span style="font-family: Arial;">&#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1080;&#1074;&#1072;&#1077;&#1090; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1082;&#1072;&#1082; &#1089;&#1080;&#1085;&#1093;&#1088;&#1086;&#1085;&#1085;&#1086;&#1075;&#1086;, &#1090;&#1072;&#1082; &#1080; &#1072;&#1089;&#1080;&#1085;&#1093;&#1088;&#1086;&#1085;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1084;&#1077;&#1085;&#1072; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1077;&#1081; &#1084;&#1077;&#1078;&#1076;&#1091; FrontEnd &#1080; BackEnd.</span></li></ul><span style="font-family: Arial;">&#1064;&#1072;&#1073;&#1083;&#1086;&#1085;&#1099; AppFrame &#1087;&#1086;&#1084;&#1077;&#1097;&#1077;&#1085;&#1099; &#1074; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075; <span style="font-weight: bold;">SpbVipTools\AppData\ProjectTemplates\Febe</span>.<br /><span style="font-weight: bold;">AppFrameCookBook</span> &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&nbsp; &#1082;&#1072;&#1082; WinHelp <span style="font-weight: bold;">SpbVipTools\Doc\AppFrame\AppFrameCookBookRu.chm.</span><br />&#1050;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075; <span style="font-weight: bold;">SpbExamples\Febe</span> &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1085;&#1072;&#1073;&#1086;&#1088;&#1072; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1074; &#1080; &#1080;&#1093; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1099;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;.<span style="font-weight: bold;"></span></span><br style="font-family: Arial;" />
<h2><span style="font-family: Arial;">&#1048;&#1089;&#1090;&#1086;&#1088;&#1080;&#1103;</span></h2>
<span style="font-family: Arial; font-weight: bold;">SpbRSolutions
Version 2.0</span><br style="font-family: Arial;" />
<span style="font-family: Arial;">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1087;&#1077;&#1088;&#1077;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1085;&#1085;&#1091;&#1102; &#1074;&#1077;&#1088;&#1089;&#1080;&#1102; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;&nbsp; WorkSpace Manager (&#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1080; &#1087;&#1088;&#1080;&#1083;&#1086;&#1077;&#1078;&#1085;&#1080;&#1077;).</span><br style="font-family: Arial;" />
<span style="font-family: Arial; font-weight: bold;">SpbRSolutions
Version 1.0</span><br style="font-family: Arial;" />
<span style="font-family: Arial;">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1089;&#1072;&#1084;&#1091;&#1102; &#1087;&#1077;&#1088;&#1074;&#1091;&#1102; &#1074;&#1077;&#1088;&#1089;&#1080;&#1102; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;&nbsp; <span style="font-weight: bold;">WorkSpace Manager</span> (&#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1080; &#1087;&#1088;&#1080;&#1083;&#1086;&#1077;&#1078;&#1085;&#1080;&#1077;).</span><br style="font-family: Arial;" />
<span style="font-family: Arial; font-weight: bold;"></span><span style="font-family: Arial;">Contained the very first
variant of the <span style="font-weight: bold;">WorkSpace Manager</span> (</span><span style="font-family: Arial;">&#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1080; &#1087;&#1088;&#1080;&#1083;&#1086;&#1077;&#1078;&#1085;&#1080;&#1077;</span><span style="font-family: Arial;">).</span><br style="font-family: Arial;" />
<span style="font-family: Arial;"></span><br style="font-family: Arial;" />
</body></html>