<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"><head>
<meta http-equiv="content-type" content="text/html; charset=ISO-8859-1" /><title>WorkSpaceManager</title></head>
<body>
<small><small>Copyright (c) Prolog Developemnt Center SPb</small></small>
<h1>PdcVipSolutions<br /></h1>
Version 2.0<br /><br />PdcVipSolutions
v.2.0 - &#1101;&#1090;&#1086; &#1085;&#1072;&#1073;&#1086;&#1088; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; (&#1082;&#1072;&#1082; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; &#1082; &#1086;&#1092;&#1080;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084;&#1091; &#1087;&#1088;&#1086;&#1076;&#1091;&#1082;&#1090;&#1091;
PDC Visual Prolog), &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1086;&#1074; (&#1091;&#1095;&#1077;&#1073;&#1085;&#1099;&#1093; &#1080; &#1076;&#1077;&#1084;&#1086;&#1085;&#1089;&#1090;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1093;) &#1080; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1074;
&#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1099;&#1093; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081;.<br />&#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1094;&#1077;&#1083;&#1100; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; 2.0 - &#1076;&#1077;&#1084;&#1086;&#1085;&#1089;&#1090;&#1088;&#1072;&#1094;&#1080;&#1103; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; <span style="font-weight: bold;">WorkSpace Manager</span>&nbsp;<span style="font-weight: bold;"></span>&#1082;&#1072;&#1082; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1086;&#1075;&#1086; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1080; &#1077;&#1075;&#1086;&nbsp;&#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1093; &#1082;&#1086;&#1076;&#1086;&#1074;.<br />&#1058;&#1077;&#1082;&#1091;&#1097;&#1072;&#1103; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103; 2.0 &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1072; &#1085;&#1072; Vip &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; 9x (&#1092;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; 9006).<br />&#1055;&#1086;&#1083;&#1085;&#1099;&#1081; &#1082;&#1086;&#1085;&#1090;&#1077;&#1085;&#1090; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085; &#1087;&#1086; &#1072;&#1076;&#1088;&#1077;&#1089;&#1091; <a href="https://github.com/PdcVipSolutions" target="_blank">https://github.com/PdcVipSolutions</a>.<br /><h2>&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</h2>&#1042;&#1077;&#1089;&#1100; &#1082;&#1086;&#1085;&#1090;&#1077;&#1085;&#1090; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1090;&#1100; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085; &#1074; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1072;&#1093; &#1089; &#1080;&#1084;&#1077;&#1085;&#1072;&#1084;&#1080;<br /><span style="font-weight: bold;">SpbRSolutions</span> (&#1082;&#1086;&#1088;&#1085;&#1077;&#1074;&#1086;&#1081; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075; &#1084;&#1086;&#1078;&#1077;&#1090; &#1080;&#1084;&#1077;&#1090;&#1100; &#1083;&#1102;&#1073;&#1086;&#1077; &#1076;&#1088;&#1091;&#1075;&#1086;&#1077; &#1080;&#1084;&#1103;)<br />&nbsp;&nbsp;&nbsp;&nbsp; <span style="font-weight: bold;">SpbVipTools</span> (&#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1103;&nbsp;&#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077;&nbsp;&#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1080;)<br />&nbsp;&nbsp;&nbsp;&nbsp; <span style="font-weight: bold;">SpbExamples</span> (&#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1080;)<br />&nbsp;&nbsp;&nbsp;&nbsp; <span style="font-weight: bold;">SpbProjects</span> (&#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1103; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1073;&#1099;&#1090;&#1100; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1072; &#1074;&#1088;&#1091;&#1095;&#1085;&#1091;&#1102;)<span style="font-weight: bold;"><br /></span><span style="font-weight: bold;"></span><br /><span style="font-weight: bold;">SpbVipTools<br /></span>&nbsp;&nbsp;&nbsp;&nbsp; <span style="font-weight: bold;">SpbVipTools</span> - &#1101;&#1090;&#1086; &#1087;&#1072;&#1082;&#1077;&#1090;&#1099; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1076;&#1072; (Vip-&#1087;&#1072;&#1082;&#1077;&#1090;&#1099;) &#1076;&#1083;&#1103; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1080; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1074; &#1080; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1086;&#1074;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1076;&#1083;&#1103; &#1076;&#1077;&#1084;&#1086;&#1085;&#1089;&#1090;&#1088;&#1072;&#1094;&#1080;&#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; <span style="font-weight: bold;">WorkSpace Manager</span>.<br />&nbsp;&nbsp;&nbsp;&nbsp; <span style="font-weight: bold;">SpbVipTools</span> &#1090;&#1072;&#1082;&#1078;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1075;&#1086;&#1090;&#1086;&#1074;&#1099;&#1077; &#1082; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1102; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1099;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099; &#1055;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1099; &#1074; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1077; <span style="font-weight: bold;">SpbProjects</span>.<br />&nbsp;&nbsp;&nbsp;&nbsp; &#1042;&#1072;&#1084; &#1085;&#1077; &#1085;&#1091;&#1078;&#1085;&#1086; &#1080;&#1084;&#1077;&#1090;&#1100; VIP9x &#1076;&#1083;&#1103; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1099;&#1093; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;. &#1055;&#1088;&#1086;&#1089;&#1090;&#1086; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1077; &#1101;&#1090;&#1086;!<br />&nbsp;&nbsp;&nbsp;&nbsp; &#1063;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; SPB VipTools, &#1074;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1080;&#1090;&#1100; &#1077;&#1075;&#1086; &#1086;&#1076;&#1085;&#1086;&#1081; &#1089;&#1074;&#1103;&#1079;&#1082;&#1086;&#1081; &#1089; <a href="https://github.com/PdcVipSolutions/SpbVipTools" target="_blank">https://github.com/PdcVipSolutions/SpbVipTools</a><br />&nbsp;&nbsp;&nbsp;&nbsp; &#1057;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072; &#1082;&#1086;&#1085;&#1090;&#1077;&#1085;&#1090;&#1072; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1085;&#1072; &#1085;&#1080;&#1078;&#1077;<br /><br /><img style="width: 160px; height: 218px;" alt="" src="VipToolsStructure.PNG" /><br /><span style="font-weight: bold;"><br /></span><span style="font-weight: bold;">SpbExamples<br /></span>&nbsp;&nbsp;&nbsp; &#1063;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; <span style="font-weight: bold;">SpbExamples</span>, &#1074;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1080;&#1090;&#1100; &#1077;&#1075;&#1086; &#1082;&#1072;&#1082; &#1086;&#1076;&#1085;&#1088;&#1081; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1086;&#1081; &#1089; <a href="https://github.com/PdcVipSolutions/SpbExamples" target="_blank">https://github.com/PdcVipSolutions/SpbExamples</a><br />&nbsp;&nbsp;&nbsp;&nbsp;&#1057;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072; &#1082;&#1086;&#1085;&#1090;&#1077;&#1085;&#1090;&#1072; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1085;&#1072; &#1085;&#1080;&#1078;&#1077;<br /><span style="font-weight: bold;"><img style="width: 143px; height: 143px;" alt="" src="ExamplesStructure.PNG" /><br /></span>&nbsp;&nbsp;&nbsp;
&#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1074;&#1093;&#1086;&#1076;&#1103;&#1090; &#1074; &#1074;&#1077;&#1088;&#1089;&#1080;&#1102; 2.0, &#1073;&#1099;&#1083;&#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1099; &#1084;&#1085;&#1086;&#1075;&#1086; &#1083;&#1077;&#1090; &#1085;&#1072;&#1079;&#1072;&#1076;. &#1054;&#1085;&#1080;
&#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1099; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1086; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1088;&#1080;&#1103; VIP9x.<br /><br /><br /><span style="font-weight: bold;">SpbProjects<br /></span>&nbsp;&nbsp;&nbsp; &#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1086; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1072;&#1077;&#1084;&#1099;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1099;:<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <span style="font-weight: bold;">WorkSpaceManager</span> (&#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1080;&#1090;&#1100; &#1089; <a href="https://github.com/PdcVipSolutions/WS_Manager" target="_blank">https://github.com/PdcVipSolutions/WS_Manager</a>)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <span style="font-weight: bold;">DelFiles</span> (&#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1080;&#1090;&#1100; &#1089; <a href="https://github.com/PdcVipSolutions/DelFiles" target="_blank">https://github.com/PdcVipSolutions/DelFiles</a>)<br /><span style="font-weight: bold;">&nbsp;&nbsp;&nbsp;&nbsp; </span>&#1057;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072; &#1082;&#1086;&#1085;&#1090;&#1077;&#1085;&#1090;&#1072; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1072; &#1085;&#1080;&#1078;&#1077;<br /><br /><img style="width: 166px; height: 168px;" alt="" src="VipProjectStructure.PNG" /><br /><h2>&#1048;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1099;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099; &#1080; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103;</h2>&#1048;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1099;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074; <span style="font-weight: bold;">SpbRSolutions\SpbVipTools\Bin</span>.<br />&#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103; &#1076;&#1083;&#1103; WorksSpace Manager &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085;&#1072; &#1087;&#1086; &#1072;&#1076;&#1088;&#1077;&#1089;&#1091; <span style="font-weight: bold;">SpbRSolutions\SpbVipTools\Bin\wsmAppData</span>, &#1075;&#1076;&#1077; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1085;&#1072;&#1081;&#1090;&#1080;<br />&nbsp;&nbsp;&nbsp;&nbsp; <span style="font-weight: bold;">ReadMe(En/Ru).pdf</span> - &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1103; &#1087;&#1086; &#1089;&#1073;&#1086;&#1088;&#1082;&#1077; &#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1091; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081;<br />&nbsp;&nbsp;&nbsp;&nbsp; <span style="font-weight: bold;">WorkSpaceManager(En/Ru).pdf</span> - &#1086;&#1073;&#1097;&#1072;&#1103; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103; &#1086;&#1073; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1077;<br />&nbsp;&nbsp;&nbsp;&nbsp; <span style="font-weight: bold;">wsm_help(En/Ru).chm</span> - &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1072;&#1103; MS-&#1089;&#1087;&#1088;&#1072;&#1074;&#1082;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1090;&#1072;&#1082;&#1078;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1099;&#1079;&#1074;&#1072;&#1090;&#1100; &#1080;&#1079; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; <span style="font-weight: bold;">WorkSpaceManager.exe</span>.<br /><br /><span style="font-weight: bold;">WorkSpaceManager</span>
&#1090;&#1072;&#1082;&#1078;&#1077; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085; &#1082;&#1072;&#1082; &#1080;&#1085;&#1090;&#1077;&#1075;&#1088;&#1072;&#1094;&#1080;&#1103; &#1073;&#1101;&#1082;&#1101;&#1085;&#1076;&#1072; &#1085;&#1072; &#1086;&#1089;&#1085;&#1086;&#1074;&#1077; http &#1080; &#1092;&#1088;&#1086;&#1085;&#1090;&#1101;&#1085;&#1076;&#1072; &#1085;&#1072;
&#1086;&#1089;&#1085;&#1086;&#1074;&#1077; http. &#1069;&#1090;&#1086; &#1087;&#1077;&#1088;&#1074;&#1099;&#1081; &#1096;&#1072;&#1075; &#1082; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;&#1084;, &#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1084; &#1085;&#1072; &#1080;&#1076;&#1077;&#1103;&#1093;
&#1084;&#1080;&#1082;&#1088;&#1086;&#1089;&#1077;&#1088;&#1074;&#1080;&#1089;&#1072;.<br />&nbsp;&nbsp;&nbsp;&nbsp; &#1059; &#1085;&#1077;&#1075;&#1086; &#1053;&#1045;&#1058; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1102;&#1097;&#1077;&#1081; &#1084;&#1085;&#1086;&#1075;&#1086;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1081; &#1088;&#1077;&#1078;&#1080;&#1084;.<br />&nbsp;&nbsp;&nbsp;&nbsp; &#1054;&#1085; &#1085;&#1077; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1077;&#1090; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1080; &#1079;&#1072;&#1087;&#1091;&#1097;&#1077;&#1085; &#1083;&#1080;&nbsp; &#1073;&#1101;&#1082;&#1101;&#1085;&#1076;.<br />&#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1094;&#1077;&#1083;&#1100;&#1102; &#1073;&#1099;&#1083;&#1086; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1079;&#1072;&#1076;&#1072;&#1095;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1086;&#1080;&#1090; &#1088;&#1077;&#1096;&#1080;&#1090;&#1100; &#1074; &#1073;&#1091;&#1076;&#1091;&#1097;&#1077;&#1084;.<br /></body></html>